app/controllers/questions_controller.rb

    def create
      @question = Question.new(question_params)

      respond_to do |format|
        if @question.save
---
INSERT INTO "questions" ("site_name", "security_question", "security_answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["site_name", "Facebook"], ["security_question", "What is your first pet?"], ["security_answer", "Cat"], ["created_at", "2018-10-27 13:35:59.823619"], ["updated_at", "2018-10-27 13:35:59.823619"]]

    def update
      respond_to do |format|
        if @question.update(question_params)
---
UPDATE "questions" SET "security_answer" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["security_answer", "Dog"], ["updated_at", "2018-10-27 13:43:24.783150"], ["id", 5]]